# import

#=============================================================
# 생성
# 빈 deque 생성

# 요소있는 deque 생성
#=============================================================
# 추가
# 오른쪽에 추가 - 틀림 X

# 왼쪽에 추가

# iterable 객체를 순환하며 값을 오른쪽에 차례로 추가 - 틀림 X

# iterable 객체를 순환하며 값을 왼쪽에 차례로 추가 - 틀림 X
#=============================================================
# 삭제
# 삭제(by value) - 틀림

# 오른쪽 값 삭제 후 반환

# 왼쪽 값 삭제 후 반환

#=============================================================
# 기타
# deque 값 시계방향 회전

# deque 값 반시계방향 회전

