def show(arr):
    for i in range(len(arr)):
        print(arr[i])
    print("==========================")

arr = [
    [1, 2],
    [3, 4]
]
length = len(arr)
rotated_arr = [[0] * length for _ in range(length)]
#==================================================================================================
# 회전(시계방향 90도) - 틀림 X

show(rotated_arr)
"""
출력
[3, 1]
[4, 2]
"""
#==================================================================================================
# 회전(반시계방향 90도) - 틀림 X

show(rotated_arr)
"""
출력
[2, 4]
[1, 3]
"""