def show(arr):
    for i in range(len(arr)):
        print(arr[i])
    print("==========================")

# 십자 회전(가운데 십자영역만 회전)
arr = [
    [0, 0, 1, 0, 0],
    [0, 0, 1, 0, 0],
    [4, 4, 1, 2, 2],
    [0, 0, 3, 0, 0],
    [0, 0, 3, 0, 0],
]
length = len(arr)

rotated_arr = [[0] * length for _ in range(length)]
#===============================================================================
# 반시계방향 회전(90도)
# 여기 구현
show(rotated_arr)
"""
출력
[0, 0, 2, 0, 0]
[0, 0, 2, 0, 0]
[1, 1, 1, 3, 3]
[0, 0, 4, 0, 0]
[0, 0, 4, 0, 0]
"""

#===============================================================================
rotated_arr = [[0] * length for _ in range(length)]
# 시계방향 회전(90도)
# 여기 구현
show(rotated_arr)
"""
출력
[0, 0, 4, 0, 0]
[0, 0, 4, 0, 0]
[3, 3, 1, 1, 1]
[0, 0, 2, 0, 0]
[0, 0, 2, 0, 0]
"""